Repository: Kostenkov-2021/ai-image-generator-nvda-addon
Catalog: locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: AI Image Generator
ru: Генератор изображений с помощью ИИ

source: Generate images using AI
ru: Создавайте изображения с помощью искусственного интеллекта

source: Opens the AI Image Generator add-on
ru: Открывает дополнение Генератор изображений с помощью ИИ

source: Enter your imagination here...
ru: Дайте волю своему воображению...

source: &Clear
ru: О&чистить

source: &About
ru: О &дополнении

source: &Generate Image
ru: &Сгенерировать изображение

source: C&lose
ru: За&крыть

source: Input cleared.
ru: Ввод очищен.

source: Please enter a valid description.
ru: Пожалуйста, введите корректное описание.

source: Error
ru: Ошибка

source: No valid description entered.
ru: Не введено корректное описание.

source: Image generation failed.
ru: Не удалось сгенерировать изображение.

source: Please wait for the image generation to complete.
ru: Пожалуйста, дождитесь завершения генерации изображения.

source: Warning
ru: Предупреждение

source: Cannot close while generating image.
ru: Не удаётся закрыть во время создания изображения.

source: Please Wait...
ru: пожалуйста, подождите...

source: AI is generating...
ru: Искусственный интеллект генерирует изображение...

source: Generating image, please wait.
ru: Генерируя изображение, пожалуйста, подождите.

source: Generated Image
ru: Сгенерированное изображение

source: &Download Image
ru: За&грузить изображение

source: Here is your described image generated with AI...
ru: Вот описание изображения, сгенерированного вами с помощью искусственного интеллекта...

source: Image generated successfully.
ru: Изображение сгенерировано успешно.

source: No image to download.
ru: Нет изображения для загрузки.

source: No image available to download.
ru: Изображение недоступно для загрузки.

source: Save Image
ru: Сохранить изображение

source: Unsupported file format.
ru: Неподдерживаемый формат файла.

source: Unsupported file format selected.
ru: Выбран неподдерживаемый формат файла.

source: Image saved as {}
ru: Изображение сохранено в формате {}

source: Success
ru: Успешно

source: Image saved successfully to {}.
ru: Изображение успешно сохранено по пути {}.

source: Error saving image: {}
ru: Ошибка при сохранении изображения: {}

source: Failed to save image.
ru: Не удалось сохранить изображение.

source: About the Add-on
ru: О дополнении

source: AI Image Generator, v0.23, developed by Sujan Rai at Team of Tech Visionary. Join my Telegram channel for accessible and unique resources. Visit my website to browse very useful and powerful tutorials on the web.
ru: Генератор изображений с помощью ИИ, версия 0.23, разработано Суджаном Раем из Team of Tech Visionary. Присоединяйтесь к моему Telegram-каналу, там вы найдёте доступные и уникальные ресурсы. Посетите мой веб-сайт, чтобы ознакомиться с очень полезными и мощными руководствами в Интернете.

source: &No Thanks
ru: &нет, спасибо

source: &Join Telegram
ru: &Подписаться на канал в Telegram

source: Visit &Website
ru: Перейти на &веб-сайт
